# Text mesages and button texts for tg bot

LEXICON = {
    'status_delivered': 'D',
    'role_delivery_man': 'D',
    'clients_greeting': 'Добро пожаловать, {full_name}!\nЗакажите доставку '
                        'праздничного букета, собранного специально для ваших '
                        'любимых, родных и коллег. Наш букет со смыслом станет'
                        ' главным подарком на вашем празднике!\n'
                        'Для продолжения нажмите "Далее".',
    'delivery_greeting': 'Добро пожаловать, {full_name}!\nНажмите '
                         '"Показать заказы", чтобы бот отправлял вам новые '
                         'заказы, которые Вам надо будет доставлять.',
    'show_accepted_orders': 'Доставить заказ: №{order_id}\n'
                            'Имя получателя: {recipient_name}\n'
                            'Дата и время: {delivery_date} {delivery_time}\n'
                            'Адрес: {delivery_address}\n',
    'instruction': 'После доставки заказа не забудьте нажать кнопку '
                   '"Заказ доставлен"',
    'no_orders_available': 'На данный момент нет заказов для доставки.\n'
                           'Возвращайтсесь чуть позже.',
    'thanks': 'Заказа № {order_id} доставлен',
    'any_occasion': 'К какому событию Вы готовитесь?',
    'choose_occasion': 'Выберите один из вариантов либо укажите собственный:',
    'input_custom_occasion': 'Введите, пожалуйста, название вашего повода.',
    'next_button': 'Далее',
    'show_orders': 'Показать заказы',
    'order_delivered_button': 'Заказ доставлен',
    'occasion_buttons': 'День Рождения, Свадьба, Школа, Без повода,'
                        'Другой повод',
}
